# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'ack'
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'doctl'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'ncdu'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'wget'

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'composer'
brew 'ghostscript'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'zsh-autosuggestions'

# Apps
cask '1password'
cask 'appcleaner'
cask 'asana'
cask 'cleanshot'
cask 'dropbox'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'google-drive'
cask 'imageoptim'
cask 'insomnia'
cask 'linear-linear'
cask 'notion'
cask 'quip'
cask 'ray'
cask 'raycast'
cask 'slack'
cask 'sonos'
cask 'soulver'
cask 'soundsource'
cask 'superhuman'
cask 'tableplus'
cask 'transmit'
cask 'visual-studio-code'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlcolorcode' 
cask 'qlstephen'  
cask 'qlprettypatch' 
cask 'quicklook-csv' 
cask 'betterzip'  
cask 'suspicious-package'


# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas 'Bear', id: 
# mas 'Cardhop', id:
# mas 'Magnet', id: 
# mas 'Paprika Recipe Manager 3', id:
# mas 'Tailscale', id:
# mas 'Things', id: 904280696
# mas 'Twitter', id:

